// !  Розгалуження
// **Інструкція if

// ? Інструкція if дозволяє виконати певний блок коду тільки в тому випадку, якщо задана умова істинна
// (тобто приймає значення true).
// Загальний синтаксис інструкції if виглядає так:

// if (condition) {
    // код, який виконується, якщо умова (condition) істинна
    // }
  
//     Коли інтерпретатор зустрічає інструкцію if, він обчислює вказану умову в круглих дужках(condition), перетворюючи її до
//     логічного типу(boolean).
//     Якщо умова (condition) перетворюється до true, виконується блок коду, написаний у фігурних дужках {} — (statement).
// ? Якщо умова (condition) є хибною (false), то код, що міститься в блоці if, не виконується.
// ? Якщо умова (condition) є істинною (true), то код, що міститься в блоці if, виконується.

// У наведених нижче прикладах код перевіряє значення змінної subscription і залежно від нього встановлює значення змінної price.
// Якщо умова перетворюється до true, тобто subscription — це "pro", price встановлюється 100.

//? Приклад 1 
// Уяви онлайн-сервіс, що дозволяє завантажувати книги з бібліотеки.
// Відвідувачі можуть користуватися сервісом безкоштовно(з обмеженням швидкості завантажень).Якщо людина бажає завантажувати 
// книги без обмежень, вона повинна купити підписку “pro” за 100$ на рік.
// Це простий приклад розгалуження, у якому наявність підписки “pro” — це умова, а різні варіанти завантажень
// (з обмеженням чи без) — це розгалуження подальших сценаріїв.
let price = 0;
const subscription = "pro";

if (subscription === "pro") {
  price = 100;
}

console.log(price); // 100


