// Об’єкти
// Створення об'єкта

// Об'єкти дозволяють описати та згрупувати характеристики об'єктів реального світу, наприклад, користувач, книга,
// продукт магазину — чого завгодно.Об'єкти ще називають словниками, тобто вони містять терміни (властивості) та їх визначення 
// (значення).

// const book = {
//   title: "The Last Kingdom",
//   author: "Bernard Cornwell",
//   genres: ["historical prose", "adventure"],
//   public: true,
//   rating: 8.38,
// };

// Для оголошення об’єкта використовуються фігурні дужки {} — літерал об'єкта.
// При створенні об'єкта до нього відразу можна додати властивості, але це не обов’язково. Кожна властивість обов’язково складається 
// з пари ключ: значення.
// Ключ також називають ім'ям властивості і це зазвичай рядок.
// Значенням властивості можуть бути будь-які типи: примітиви, масиви, об'єкти, булі, функції тощо.
// Властивості між собою розділяються комою.

// Вибери синтаксис літерала об'єкта

// []
// {}
// ()
// Result

// Так, ти все знаєш! Для оголошення об'єкта використовуються фігурні дужки `{}`. Круглі дужки — для виклику функції, 
// а квадратні — для масиву.

// Вибери символ, яким розділяється ім'я та значення властивості

// =
// ;
// :
// ,
// Result

// І це правильна відповідь! Ім'я та значення властивості розділяються `:` (двокрапкою). Різні властивості розділяються 
// між собою `,` (комою). Після блоку коду ставиться `;` (крапка з комою). А `=` використовується для прирівняння значення.